---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewTemplateForSchedule
source: html/cfdb88e4-57cc-c058-740c-423f2ae69f04.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewTemplateForSchedule Property

"View Template"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewTemplateForSchedule { get; }
```